---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementArrayIterator
source: html/12c63fdd-019f-5074-ce47-16d09f4306de.htm
---
# ElementArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.